const { response } = require('express');
const express = require('express');

const cors = require('cors');

const bodyParser = require('body-parser');

const jsonParser = bodyParser.json();

const fs = require('fs')

const app = express();

app.use(cors());

const port = 8000;

// let categories = [
//     {
//         id:1,
//         name:'Blog',
//         imageUrl:'https://mgl.gogo.mn/newsn/thumbnail/1000/images/c/2023/01/-25012023-1674613126-1936153437-Picture1.jpg',
//         description:'Гадаадад суугаа Монголчууд төрийн үйлчилгээг цахимаар авах боломжтой',
//         text:`Иргэд 2020 оноос төрийн үйлчилгээг цаг алдалгүй авч эхэлснээр үнэт цаг зав болон мөнгөө хэмнэх олон давуу байдлууд дагаад бий болсон. Харин эдгээр төрийн үйлчилгээг цахимаар авахын тулд “ДАН” системд иргэн өөрийгөө таниулан баталгаажуулах шаардлагатай байдаг.Гадаад улсад оршин суугаа иргэдийн хувьд өөрийн нэр дээр бүртгэлтэй утасны дугаар эсвэл интернэт банк эрх байхгүй тохиолдолд И-Монгол системд нэвтрэхэд хүндрэлтэй байсан.Танилт нэвтрэлтийн “ДАН” систем нь цахим орчинд бүхий л төрлийн цахим үйлчилгээг авахад тухайн иргэнийг таньж баталгаажуулах боломжийг бүрдүүлэх, хувийн хэвшил болон төрийн үйлчилгээний өөр хоорондоо харилцан хамааралгүй системүүдтэй нягт уялдаатай ажиллах боломжтой платформ бүхий систем юм.`,
        
//     },
//     {
//         id:2,
//         name:'Technology',
//          imageUrl:'https://mgl.gogo.mn/newsn/thumbnail/1000/images/c/2023/01/302416-20012023-1674205020-654589714-11.jpg',
//         description:'Нэткапитал санхүүгийн групп Мэдээллийн аюулгүй байдлын удирдлагын тогтолцооны ISO/IEC 27001:2013 стандартыг нэвтрүүллээ',
//         text:`Дижитал эринд финтек хувьслаар манлайлах зорилготой Нэткапитал санхүүгийн групп өнгөрсөн жил Чанарын Удирдлагын Тогтолцооны ISO 9001:2015 стандартыг нэвтрүүлж байсан бол ийнхүү  2023 оны босго дээр Мэдээллийн Аюулгүй Байдлын Удирдлагын Тогтолцооны ISO/IEC 27001:2013 олон улсын стандартыг нэвтрүүлж сертификатаа гардан авч Олон улсад хүлээн зөвшөөрөгдсөн хоёр стандарттай боллоо.Тус стандарт нь мэдээллийн аюулгүй байдлын удирдлагын тогтолцоог бий болгох, хэрэгжүүлэх, хяналт тавих, дэмжих ба сайжруулах зэрэг шаардлагуудыг хэрэгжүүлдэг стандарт юм. Ингэснээр зээл болон төлбөр тооцооны үйлчилгээг харилцагч нартаа мэдээллийн аюулгүй байдлын Олон улсын стандартад нийцүүлэн хүргэх боломжтой боллоо.Бидэнтэй хамтран ажилладаг байгууллагууд, Эрхэм харилцагчид, Хөрөнгө оруулагч та бүхэндээ талархал илэрхийлж, та бүхний мэдээллийн аюулгүй байдлыг чандлан хамгаалж олон улсын стандартад нийцүүлэн ажиллах болсондоо баяртай байна.`
//         },
//     {
//         id:3,
//         name:'Бизнес',
//         imageUrl:'https://mgl.gogo.mn/newsn/thumbnail/1000/images/c/2023/01/301980-09012023-1673255994-1135445056-Snow_Depth_20230109_00-20230109_00.jpg',
//          description:'Дэлхийн хамгийн хүчирхэг супер компьютерыг хөргөхөд 22,000 литр ус шаардагддаг',
//          text:`Супер компьютерын нэг секундэд хийх тооцоолол нэг квинтиллионы босгыг давав.АНУ-ын Теннесси мужийн эрдэмтдийн бүтээсэн супер компьютерын нэг секундэд хийх тооцоолол нэг квинтиллионы (10-ыг 18 зэрэгт дэвшүүлсэнтэй тэнцүү) босгыг давсан нь түүхэн амжилт болоод байна. Албан ёсоор дэлхийн хамгийн хурдан компьютер гэж тооцогдож буй "Frontier" хэмээх системийг ажиллуулахад асар том дэд бүтэц, өндөр түвшинд бэлтгэгдсэн ажилчид, мөн их хэмжээний ус шаардагддаг аж.Компьютерын хөргөлтийн систем нь дангаараа 678м2 талбайтай,д 350 морины хүчтэй аварга шахуургуудын тусламжтайгаар минутад 22 мянга гаруй литр ус эргэлдүүлж, 9000 гаруй тооцоологч нэгжүүдэд хүргэдэг байна. Ийм хэмжээний дэд бүтэцгүй бол супер компьютер тэр даруй хайлах юм. Түүнчлэн усыг урьдчилан хөргөх шаардлагагүй учраас эрчим хүчний зарцуулалтыг хэмнэх давуу талтай юм байна.2022 онд анх ажиллаж эхэлснээс нь төд удалгүй олон нийтэд нээлттэй өгөгдөл дээр нь суурилан “Frontier”-ийг дэлхийн хамгийн хурдан компьютер хэмээн тодорхойлсон байна. Уг компьютер нэг секундэд нэг квинтиллион давсан тооцоолол хийснээрээ мэдээллийн технологийн “Exascale” хил хязгаарыг эвдэж чаджээ. Энэ нь дэлхий дээрх хүн бүр дөрвөн жилийн турш огт завсарлалгүйгээр нэг минутад 60 тооцоолол хийж байгаатай дүйцэх хэмжээ аж.`
    
//         },
//     {
//         id:4,
//         name:'Бизнес',
//         imageUrl:'https://mgl.gogo.mn/newsn/thumbnail/1000/images/c/2023/01/301980-09012023-1673255994-1135445056-Snow_Depth_20230109_00-20230109_00.jpg',
//          description:'Дэлхийн хамгийн хүчирхэг супер компьютерыг хөргөхөд 22,000 литр ус шаардагддаг',
//          text:`Супер компьютерын нэг секундэд хийх тооцоолол нэг квинтиллионы босгыг давав.АНУ-ын Теннесси мужийн эрдэмтдийн бүтээсэн супер компьютерын нэг секундэд хийх тооцоолол нэг квинтиллионы (10-ыг 18 зэрэгт дэвшүүлсэнтэй тэнцүү) босгыг давсан нь түүхэн амжилт болоод байна. Албан ёсоор дэлхийн хамгийн хурдан компьютер гэж тооцогдож буй "Frontier" хэмээх системийг ажиллуулахад асар том дэд бүтэц, өндөр түвшинд бэлтгэгдсэн ажилчид, мөн их хэмжээний ус шаардагддаг аж.Компьютерын хөргөлтийн систем нь дангаараа 678м2 талбайтай,д 350 морины хүчтэй аварга шахуургуудын тусламжтайгаар минутад 22 мянга гаруй литр ус эргэлдүүлж, 9000 гаруй тооцоологч нэгжүүдэд хүргэдэг байна. Ийм хэмжээний дэд бүтэцгүй бол супер компьютер тэр даруй хайлах юм. Түүнчлэн усыг урьдчилан хөргөх шаардлагагүй учраас эрчим хүчний зарцуулалтыг хэмнэх давуу талтай юм байна.2022 онд анх ажиллаж эхэлснээс нь төд удалгүй олон нийтэд нээлттэй өгөгдөл дээр нь суурилан “Frontier”-ийг дэлхийн хамгийн хурдан компьютер хэмээн тодорхойлсон байна. Уг компьютер нэг секундэд нэг квинтиллион давсан тооцоолол хийснээрээ мэдээллийн технологийн “Exascale” хил хязгаарыг эвдэж чаджээ. Энэ нь дэлхий дээрх хүн бүр дөрвөн жилийн турш огт завсарлалгүйгээр нэг минутад 60 тооцоолол хийж байгаатай дүйцэх хэмжээ аж.`
    
//         },
//     {
//         id:5,
//         name:'Бизнес',
//         imageUrl:'https://mgl.gogo.mn/newsn/thumbnail/1000/images/c/2023/01/301980-09012023-1673255994-1135445056-Snow_Depth_20230109_00-20230109_00.jpg',
//          description:'Дэлхийн хамгийн хүчирхэг супер компьютерыг хөргөхөд 22,000 литр ус шаардагддаг',
//          text:`Супер компьютерын нэг секундэд хийх тооцоолол нэг квинтиллионы босгыг давав.АНУ-ын Теннесси мужийн эрдэмтдийн бүтээсэн супер компьютерын нэг секундэд хийх тооцоолол нэг квинтиллионы (10-ыг 18 зэрэгт дэвшүүлсэнтэй тэнцүү) босгыг давсан нь түүхэн амжилт болоод байна. Албан ёсоор дэлхийн хамгийн хурдан компьютер гэж тооцогдож буй "Frontier" хэмээх системийг ажиллуулахад асар том дэд бүтэц, өндөр түвшинд бэлтгэгдсэн ажилчид, мөн их хэмжээний ус шаардагддаг аж.Компьютерын хөргөлтийн систем нь дангаараа 678м2 талбайтай,д 350 морины хүчтэй аварга шахуургуудын тусламжтайгаар минутад 22 мянга гаруй литр ус эргэлдүүлж, 9000 гаруй тооцоологч нэгжүүдэд хүргэдэг байна. Ийм хэмжээний дэд бүтэцгүй бол супер компьютер тэр даруй хайлах юм. Түүнчлэн усыг урьдчилан хөргөх шаардлагагүй учраас эрчим хүчний зарцуулалтыг хэмнэх давуу талтай юм байна.2022 онд анх ажиллаж эхэлснээс нь төд удалгүй олон нийтэд нээлттэй өгөгдөл дээр нь суурилан “Frontier”-ийг дэлхийн хамгийн хурдан компьютер хэмээн тодорхойлсон байна. Уг компьютер нэг секундэд нэг квинтиллион давсан тооцоолол хийснээрээ мэдээллийн технологийн “Exascale” хил хязгаарыг эвдэж чаджээ. Энэ нь дэлхий дээрх хүн бүр дөрвөн жилийн турш огт завсарлалгүйгээр нэг минутад 60 тооцоолол хийж байгаатай дүйцэх хэмжээ аж.`
    
//         },
//     {
//         id:6,
//         name:'Бизнес',
//         imageUrl:'https://mgl.gogo.mn/newsn/thumbnail/1000/images/c/2023/01/301980-09012023-1673255994-1135445056-Snow_Depth_20230109_00-20230109_00.jpg',
//          description:'Дэлхийн хамгийн хүчирхэг супер компьютерыг хөргөхөд 22,000 литр ус шаардагддаг',
//          text:`Супер компьютерын нэг секундэд хийх тооцоолол нэг квинтиллионы босгыг давав.АНУ-ын Теннесси мужийн эрдэмтдийн бүтээсэн супер компьютерын нэг секундэд хийх тооцоолол нэг квинтиллионы (10-ыг 18 зэрэгт дэвшүүлсэнтэй тэнцүү) босгыг давсан нь түүхэн амжилт болоод байна. Албан ёсоор дэлхийн хамгийн хурдан компьютер гэж тооцогдож буй "Frontier" хэмээх системийг ажиллуулахад асар том дэд бүтэц, өндөр түвшинд бэлтгэгдсэн ажилчид, мөн их хэмжээний ус шаардагддаг аж.Компьютерын хөргөлтийн систем нь дангаараа 678м2 талбайтай,д 350 морины хүчтэй аварга шахуургуудын тусламжтайгаар минутад 22 мянга гаруй литр ус эргэлдүүлж, 9000 гаруй тооцоологч нэгжүүдэд хүргэдэг байна. Ийм хэмжээний дэд бүтэцгүй бол супер компьютер тэр даруй хайлах юм. Түүнчлэн усыг урьдчилан хөргөх шаардлагагүй учраас эрчим хүчний зарцуулалтыг хэмнэх давуу талтай юм байна.2022 онд анх ажиллаж эхэлснээс нь төд удалгүй олон нийтэд нээлттэй өгөгдөл дээр нь суурилан “Frontier”-ийг дэлхийн хамгийн хурдан компьютер хэмээн тодорхойлсон байна. Уг компьютер нэг секундэд нэг квинтиллион давсан тооцоолол хийснээрээ мэдээллийн технологийн “Exascale” хил хязгаарыг эвдэж чаджээ. Энэ нь дэлхий дээрх хүн бүр дөрвөн жилийн турш огт завсарлалгүйгээр нэг минутад 60 тооцоолол хийж байгаатай дүйцэх хэмжээ аж.`
    
//         },
//     ];

// const headers = [
//     {
//         id:1,
//         name:'Blog',
//         categories,
//     },
//     {
//         id:2,
//         name:'Technology'
//     },{
//         id:3,
//         name:'Бизнес'
//     },{
//         id:4,
    
//     }
// ]

// let nextCatId = categories.length


let categories = JSON.parse(fs.readFileSync('categoryData.json', 'utf8'));

const updateCategoriesFile = () =>{
    fs.writeFileSync('categoryData.json', JSON.stringify(categories));
}

app.get('/categories', (request, response)=>{
    response.json(categories);
});

// app.get('/headers', (request, response) =>{
//     response.status(200);
//     response.json(headers)
// })

app.get('/categories/:id', (req,res)=>{
    const { id } =req.params;
    let category = null;
    for(const row of categories){
        if( id == row.id){
            category = cat;
            break;
        }
    }
    res.json(category)
})

app.delete('/categories/:id', (req, res )=>{
    const { id } =req.params;
    categories = categories.filter((row) => row.id !== Number(id));
    updateCategoriesFile();
    res.json(id);
});


app.post('/categories', jsonParser,(req,res)=>{
    const { name, description } =req.body;
    const newCategory = {id: nextCatId++, name,description};
    categories.push(newCategory);
    updateCategoriesFile();
    res.send(newCategory)
});

app.put('/categories', jsonParser,(req,resddsdsa)=>{
    const { id } =req.params
    const { name, description } =req.body;
    
    let updatedCat;
    categories = categories.map((row) =>{
        if(row.id === Number(id)){
            updatedCat = { id: Number(id), name};
            return updatedCat
        }
        return row
    });
    updateCategoriesFile();
    res.json(updatedCat)
});


// app.get('/generateNumbers',(req, res)=>{
//     let result = '';
//     for(let i = 0; i<10000; i++){
//         let n = '';
//         if(i<1000){
//             n +='0'
//         }
//         if(i<100){
//             n +='0'
//         }
//         if(i<10){
//             n +='0'
//         }
//         n += i;
//         result += `9911${n}\n`;
//     }
//     fs.writeFileSync('phones.txt', result)
//     res.json('Done');
// });

// app.get('/numbers', (req,res)=>{
//     const numbers =fs.readFileSync('phones.txt', 'utf-8');
//     res.json(numbers.split('\n'))
// }


let products = JSON.parse(fs.readFileSync('MOCK_DATA.json', 'utf-8'))

console.log(products[2]);








app.get('/products', (req, res)=>{
    let {pageSize, page, priceTo, priceFrom, q} = req.query;
    pageSize = Number(pageSize) || 10;
    page = Number(page) || 1;
    let start, end;

    start = (page - 1)*pageSize;
    end = start + pageSize;
    q = [];

    for(let i = 0; i < products.length; i++)
    {
    if(products[i].name === 'Kiwano')
    {
        q = products[i];
    }
    }

    const item = q



    
    

    res.json({
        total:products.length,
        totalPages: Math.ceil(products.length/pageSize),
        q,
        page,
        pageSize,
        q:'Kiwano',
        item,

    });
});






app.listen(port, ()=>{
    console.log('http//localhost:'+port)
});