[
    {
        "id":1,
        "name":"Blog",
        "imageUrl":"https://mgl.gogo.mn/newsn/thumbnail/1000/images/c/2023/01/-25012023-1674613126-1936153437-Picture1.jpg",
        "description":"Гадаадад суугаа Монголчууд төрийн үйлчилгээг цахимаар авах боломжтой",
        "text":"эхэлснээр үнэт цаг зав болон мөнгөө ху байдлууд дагаад "
    },
    {
        "id":2,
        "name":"Technology",
         "imageUrl":"https://mgl.gogo.mn/newsn/thumbnail/1000/images/c/2023/01/302416-20012023-1674205020-654589714-11.jpg",
        "description":"Нэткапитал санхүүгийн групп Мэдээллийн аюулгүй байдлын удирдлагын тогтолцооны ISO/IEC 27001:2013 стандартыг нэвтрүүллээ",
        "text":"Дижитал эринд финтек хувьслаар манлайлах зорилготой Нэткапитал санхүүгийн групп өнгөрсөн жил Чанарын Удирдлагын Тогтолцооны ISO 9001:2015 стандартыг нэвтрүүлж байсан бол ийнхүү  2023 оны босго дээр Мэдээллийн Аюулгүй Байдлын Удирдлагын Тогтолцооны ISO/IEC 27001:2013 олон улсын стандартыг нэвтрүүлж сертификатаа гардан авч Олон улсад хүлээн зөвшөөрөгдсөн хоёр стандарттай боллоо.Тус стандарт нь мэдээллийн аюулгүй байдлын удирдлагын тогтолцоог бий болгох, хэрэгжүүлэх, хяналт тавих, дэмжих ба сайжруулах зэрэг шаардлагуудыг хэрэгжүүлдэг стандарт юм. Ингэснээр зээл болон төлбөр тооцооны үйлчилгээг харилцагч нартаа мэдээллийн аюулгүй байдлын Олон улсын стандартад нийцүүлэн хүргэх боломжтой боллоо.Бидэнтэй хамтран ажилладаг байгууллагууд, Эрхэм харилцагчид, Хөрөнгө оруулагч та бүхэндээ талархал илэрхийлж, та бүхний мэдээллийн аюулгүй байдлыг чандлан хамгаалж олон улсын стандартад нийцүүлэн ажиллах болсондоо баяртай байна."
        },
    {
        "id":3,
        "name":"Бизнес",
        "imageUrl":"https://mgl.gogo.mn/newsn/thumbnail/1000/images/c/2023/01/301980-09012023-1673255994-1135445056-Snow_Depth_20230109_00-20230109_00.jpg",
         "description":"Дэлхийн хамгийн хүчирхэг супер компьютерыг хөргөхөд 22,000 литр ус шаардагддаг",
         "text":"Супер компьютерын нэг секундэд хийх тооцоолол нэг квинтиллионы босгыг давав.АНУ-ын Теннесси мужийн эрдэмтдийн бүтээсэн супер компьютерын нэг секундэд хийх тооцоолол нэг квинтиллионы (10-ыг 18 зэрэгт дэвшүүлсэнтэй тэнцүү) босгыг давсан нь түүхэн амжилт болоод байна. Албан ёсоор дэлхийн хамгийн хурдан компьютер гэж тооцогдож буй 'Frontier' хэмээх системийг ажиллуулахад асар том дэд бүтэц, өндөр түвшинд бэлтгэгдсэн ажилчид, мөн их хэмжээний ус шаардагддаг аж.Компьютерын хөргөлтийн систем нь дангаараа 678м2 талбайтай,д 350 морины хүчтэй аварга шахуургуудын тусламжтайгаар минутад 22 мянга гаруй литр ус эргэлдүүлж, 9000 гаруй тооцоологч нэгжүүдэд хүргэдэг байна. Ийм хэмжээний дэд бүтэцгүй бол супер компьютер тэр даруй хайлах юм. Түүнчлэн усыг урьдчилан хөргөх шаардлагагүй учраас эрчим хүчний зарцуулалтыг хэмнэх давуу талтай юм байна.2022 онд анх ажиллаж эхэлснээс нь төд удалгүй олон нийтэд нээлттэй өгөгдөл дээр нь суурилан “Frontier”-ийг дэлхийн хамгийн хурдан компьютер хэмээн тодорхойлсон байна. Уг компьютер нэг секундэд нэг квинтиллион давсан тооцоолол хийснээрээ мэдээллийн технологийн “Exascale” хил хязгаарыг эвдэж чаджээ. Энэ нь дэлхий дээрх хүн бүр дөрвөн жилийн турш огт завсарлалгүйгээр нэг минутад 60 тооцоолол хийж байгаатай дүйцэх хэмжээ аж."
    
        }
]